[
    {
        "title": "Deadline for submitting 2025 Hall of Fame nominations approaching on Monday, June 30",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250609j0nyjd",
        "description": "COOKEVILLE, Tenn. – Every year, the Tennessee Tech Sports Hall of Fame inducts some of the legendary figures over more than a century of Golden Eagle Athletics. These spectacular student-athletes have woven a rich tapestry of incredible feats and left a tremendous legacy for those who currently don the purple and gold.",
        "pubDate": "Mon, 09 Jun 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2025_HOF_Nominations_Open.jpg?max_width=600&max_height=315"
    },
    {
        "title": "283 Tech student-athletes named to Spring 2025 Athletic Director's Honor Roll",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250605mtl7pv",
        "description": "COOKEVILLE, Tenn. – Tennessee Tech's student-athletes continued their impressive work in the classroom, closing out the 2024-25 academic year with yet another incredible semester with a spring GPA of 3.477 GPA collectively.",
        "pubDate": "Fri, 06 Jun 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2025_Spring_Athletic_Director-s_Honor_Roll_2.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Golden Eagle student-athletes record 33rd straight semester with a 3.0 or better GPA",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250605ifu5sf",
        "description": "COOKEVILLE, Tenn. – Tennessee Tech's student-athletes continued to raise the bar in the classroom during the Spring 2025 semester, securing Golden Eagle Athletics' 11th-straight semester with a departmental GPA of at least 3.20.",
        "pubDate": "Thu, 05 Jun 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2025_Spring_GPA.jpg?max_width=600&max_height=315"
    },
    {
        "title": "OVC selects Nye as 2024-25 Steve Hamilton Award winner",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250523je555p",
        "description": "BRENTWOOD, Tenn. – The first soccer student-athlete to earn five All-OVC honors, Meredith Nye proved to be a winner on the pitch, in the classroom, and in the community throughout her Tennessee Tech tenure. The Ohio Valley Conference recognized her efforts Friday morning, announcing the Golden Eagle midfielder as the league's Steve Hamilton Sportsmanship Award winner for 2024-25.",
        "pubDate": "Fri, 23 May 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2024-25_OVC_Steve_Hamilton_Award_-_Meredith_Nye.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Isringhausen named 2024-25 OVC Female Athlete of the Year",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250521hznsdc",
        "description": "BRENTWOOD, Tenn. – The record-shattering dominance of Madolyn Isringhausen's senior campaign on the volleyball court came full circle for the Tennessee Tech star on Wednesday morning, as the Ohio Valley Conference announced the Golden Eagle outside hitter as the league's Female Athlete of the Year for 2024-25.",
        "pubDate": "Wed, 21 May 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2024-25_OVC_Female_Athlete_of_the_Year_-_Madolyn_Isringhausen.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Ridge-Runner Riffs & Eagle-Eye Encores: A Concert Almanac for Tennessee Tech",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250508ha2oqi",
        "description": "Cookeville, Tennessee sits in the sweet spot where Appalachian foothills yield to cedar-lined pastures, and where a Thursday-night thunderstorm can ride the Cumberland Plateau farther than any Wi-Fi signal. That geography also gifts Tennessee Tech students a stealth advantage: they’re a single interstate hop from two of America’s liveliest music capitals—Nashville to the west and Knoxville to the east—plus a constellation of outdoor amphitheaters tucked inside quarry walls, riverside parks, and football cathedrals. Golden Eagles can wrap a biomechanics lab, toss jeans into a duffel, and—before the steam has faded off the campus eagle statue—be scanning digital tickets at the gates of a Grammy winner’s sound-check. To turn that spontaneity into a semester-long game plan, the guide below spotlights fifteen mega-touring artists likely to circle Middle Tennessee this year, paired with four venues that funnel them to our backyard.",
        "pubDate": "Thu, 08 May 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2025_TicketSmarter_Graphic_May.png?max_width=600&max_height=315"
    },
    {
        "title": "Coming home: Winningham rejoins alma mater as Head Athletic Trainer",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250505l1s5sl",
        "description": "COOKEVILLE, Tenn. – You’d be hard-pressed to find anyone who bleeds Purple and Gold more than Jennifer Winningham Owens. So when the opportunity arose for Winningham to return to Tennessee Tech as its newest Head Athletic Trainer, the decision was an easy one.\r\n\r\n“There has always been hope that I would someday get to return home to Tech in this position,” Winningham said. “I am super excited to be returning to Cookeville and Tennessee Tech.\r\n\r\n“This isn’t just a job for me. This is coming back to my alma mater that I have had such pride in since starting school in 1999. You will not find anyone with more Tech pride than the Winningham family.”",
        "pubDate": "Mon, 05 May 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/Winningham_hire_banner.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Mark Wilson resigns as Tennessee Tech University Director of Athletics",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250427vnk2jv",
        "description": "COOKEVILLE, Tenn. – Following 21 years leading the Tennessee Tech athletic department to new levels of success across the playing fields, the classroom, and the community, Mark Wilson is resigning as director of athletics for the Golden Eagles effective June 30, the end of the fiscal year.",
        "pubDate": "Sun, 27 Apr 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2025_Mark_Wilson_Resigns.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Field is full, waitlist now open for 2025 Pepsi Bobby Nichols Golden Eagle Scramble presented by Michelob Ultra",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250331ipcxq6",
        "description": "COOKEVILLE, Tenn. – It didn't take long for the excitement and anticipation for the annual Pepsi Bobby Nichols Golden Eagle Scramble presented by Michelob Ultra to live up to the bidding, as the 2025 edition of Tennessee Tech Athletics' fundraising event boasted a full field less than two hours after opening for registration on Monday, Mar. 31.",
        "pubDate": "Mon, 31 Mar 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2025_BNGES_Full_Field_copy.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Dr. Samantha Bates named recipient of OVC's Thurston Banks Award for Distinguished Academic Service",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250325igoucp",
        "description": "BRENTWOOD, Tenn. – Dr. Samantha Bates of Tennessee Tech University has been named one of two recipients of the 2025 Ohio Valley Conference Thurston Banks Award for Distinguished Academic Service.",
        "pubDate": "Tue, 25 Mar 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2025_Thurston_Banks_Award_Recipient_Samantha_Bates.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Clear bag policy in effect for NCAA regional games in South Carolina",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250320ky5wai",
        "description": "COLUMBIA, S.C. -- For fans traveling down to South Carolina for the Tennessee Tech women's basketball team's game against the Gamecocks in the first round of the NCAA Women's Basketball tournament, please be aware that Colonial Life Arena has a clear-bag policy.",
        "pubDate": "Thu, 20 Mar 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/SC_Clear_Bag.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Tech March Madness gear now available",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250320l9zfot",
        "description": "COOKEVILLE. Tenn. -- If you're looking for that souvenir to celebrate the Tennessee Tech women's basketball team's historic march to the 2025 NCAA Women's Basketball Tournament, you can order now through the University Bookstore and Spirit Shop!\r\n\r\nFollow this link -- https://tennesseetech.prestosports.com/general/2024-25/releases/20250320ky5wai  -- to order your March Madness gear now!\r\n\r\nThe Golden Eagle women take on top-seeded South Carolina Friday at 4 p.m. Eastern, 3 p.m. Central.",
        "pubDate": "Thu, 20 Mar 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/Tshirt.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Wings Up Pregame continues in South Carolina at The Placery",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250317kr5jpm",
        "description": "COLUMBIA, S.C. – While the Tennessee Tech women’s basketball team is going dancing, the party’s not stopping either as the Wings Up Pregame rolls on to South Carolina for the NCAA Women’s Tournament.\r\n\r\nWith Friday’s tipoff against top-seeded South Carolina set for a 4 p.m. Eastern/3 p.m. Central start, the Wings Up Pregame will be at The Placery in the Hyatt Place Columbia (819 Gervais Street, Columbia, S.C.).",
        "pubDate": "Mon, 17 Mar 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/sports/wbkb/2024-25/Banner_A00_1505_copy.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Pepsi Golden Eagle Scramble presented by Michelob Ultra set for June 6-8, registration opens March 31 at 8 AM",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250303izunfw",
        "description": "COOKEVILLE, Tenn. – Save the dates! The Pepsi Golden Eagle Scramble presented by Michelob Ultra is officially back for 2025, with Tennessee Tech Athletics announcing the dates for the popular fundraising event.",
        "pubDate": "Tue, 11 Mar 2025 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2025_BNGES_Dates_-_Registration_Announcment.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Wings Up Pregame events to be held at Evansville's Tiki on Main",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250304o3f33z",
        "description": "EVANSVILLE, Ind. – Fans heading up to Evansville for the 2025 Ohio Valley Conference Basketball Championships cane meet up with fellow Tennessee Tech fans, grab a quick bite and get ready for the excitement at Tiki on Main as the Wings Up Pregame events will be held there for the third straight season.\r\nEach Wings Up Pregame will be approximately two hours before each tipoff at the restaurant (524 Main Street, Evansville) with the first one Wednesday at 4 p.m. before the Tech men’s tournament opener against UT Martin at 6 p.m. from the Ford Center.\r\nFriday’s Wings Up Pregame will be at 11 a.m. before the Golden Eagle women play in their semifinal contest.\r\nThe Wings Up Pregame is the official spot for Golden Eagle fans during the tournament with performances by the Tennessee Tech Spirit Squads and the Golden Eagle brass.\r\nTickets for the OVC Basketball Championships are on sale now – call (931) 372-3940, visit the Hooper Eblen Center ticket office or order online at TTUsports.com or OVCsports.com.",
        "pubDate": "Tue, 04 Mar 2025 05:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/Tiki_banner.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Broadway Marvels and Comedy Revels: A Tennessee Tech Golden Eagles Entertainment Extravaganza",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250303fsqz4c",
        "description": "From legendary Broadway productions to laugh-out-loud comedy acts, each of these incredible shows and performers on tour this year offers a memorable journey. Let’s take a look at a spectacular variety of shows and comedy sets, each with its own captivating story and extraordinary history.",
        "pubDate": "Mon, 03 Mar 2025 05:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2025_TicketSmarter_Graphic.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Tennessee Tech Athletics names official NIL collective",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250220gge34p",
        "description": "COOKEVILLE, Tenn. – The Golden Eagle Collective has been named the official Name, Image, and Likeness (\"NIL\") collective for Tennessee Tech Athletics -- designed to empower student-athletes across all sports through NIL opportunities and community support.\r\n\r\nThe mission of The Golden Eagle Collective is to facilitate NIL partnerships between Tennessee Tech student-athletes, local businesses, community organizations, non-profits, and fans. By working in lockstep with Tennessee Tech Athletics, the collective ensures that its efforts align with the University’s vision for success, providing key benefits that enhance the overall student-athlete experience.",
        "pubDate": "Thu, 20 Feb 2025 05:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/Collective_banner.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Tennessee Tech Athletics partners with Nike and BSN SPORTS",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250211hnbyx6",
        "description": "Tennessee Tech University is honored to announce a multi-year partnership with Nike and BSN SPORTS. Nike, the Oregon-based global leader in footwear and sports apparel will become the official outfitter of Tennessee Tech University beginning July 1, 2025. BSN SPORTS, the premier platform for team sports solutions, will serve as the official supplier of Golden Eagle athletic uniform, apparel and footwear needs for the duration of the partnership.\r\n \r\nAs part of the agreement, Nike will provide on-field and training footwear and gear for Tennessee Tech’s 15 NCAA Division I varsity sports and spirit squads. Additionally, Nike will outfit members of the athletic department including coaches and staff.",
        "pubDate": "Tue, 11 Feb 2025 05:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/Nike_announcement_graphic_copy.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Fall 2024 AD Honor Roll boasts whopping 296 Golden Eagle student-athletes",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250107pbp9sh",
        "description": "COOKEVILLE, Tenn. – Tennessee Tech's student-athletes produced another impressive showing in the classroom, opening the 2024-25 academic year with spectacular results for the spring after posting a 3.467 GPA collectively.",
        "pubDate": "Wed, 08 Jan 2025 05:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2024-25_Tennessee_Tech_AD_Honor_Roll_Fall_-24.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Tennessee Tech student-athletes make it 32 straight semesters with 3.0 or better GPA",
        "link": "https://www.ttusports.com/general/2024-25/releases/20250107mpc0ru",
        "description": "COOKEVILLE, Tenn. – Tennessee Tech's student-athletes turned in an eye-popping performance in the classroom during the Fall 2024 semester, securing Golden Eagle Athletics' 10th-straight semester with a departmental GPA of at least 3.20.",
        "pubDate": "Tue, 07 Jan 2025 05:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2024-25_Tennessee_Tech_Fall_-24_GPA.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Twenty-seven Golden Eagles receive degrees at 2024 Winter Commencement",
        "link": "https://www.ttusports.com/general/2024-25/releases/20241213n7pyqi",
        "description": "COOKEVILLE, Tenn. -- All donned in their purple and gold caps and gowns, Tennessee Tech saw 27 student-athletes, support staff and coaches receive degrees on Friday as the University held its winter commencement exercises at the Hooper Eblen Center.",
        "pubDate": "Fri, 13 Dec 2024 05:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/Simmons_2.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Tennessee Tech tops OVC Commissioner's Cup standings following end of fall championship season",
        "link": "https://www.ttusports.com/general/2024-25/releases/20241205x56w08",
        "description": "BRENTWOOD, Tenn. – Following the completion of the fall sport championships, Tennessee Tech leads the 2024-25 Ohio Valley Conference Commissioner's Cup all-sport trophy standings; the Cup is a symbol of overall athletic excellence in Conference-sponsored championships.",
        "pubDate": "Thu, 05 Dec 2024 05:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2024-25_OVC_Commissioner-s_Cup_Fall_Standings.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Tech student-athletes maintain impressive marks in latest NCAA Graduation Success Rate report",
        "link": "https://www.ttusports.com/general/2024-25/releases/20241119l94loc",
        "description": "COOKEVILLE, Tenn. – Tennessee Tech student-athletes posted impressive scores in the latest Graduation Success Rate (GSR) and Federal Graduation Rate (FGR) reports, released Wednesday afternoon by the NCAA. Tech has not only maintained a high level of success in the school's graduation rates overall, but the student-athlete graduation rates also continue to rank higher than those for the general TTU student body.",
        "pubDate": "Tue, 19 Nov 2024 05:00:00 GMT",
        "image_url": "https://www.ttusports.com/sports/mbkb/2024-25/photos/2024-25_NCAA_GSR_FGR_Report.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Toney honored as recipient of prestigious OVC Scholar-Athlete Award for 2024-25",
        "link": "https://www.ttusports.com/general/2024-25/releases/20241114lx3ghk",
        "description": "BRENTWOOD, Tenn. – What has become a long-standing, Tennessee Tech Athletics tradition, one more Golden Eagle student-athlete was recognized for succeeding at the highest level of the Ohio Valley Conference Thursday afternoon as the League announced its six recipients of the 2024-25 OVC Scholar-Athlete Award, including women's soccer forward Katie Toney.",
        "pubDate": "Thu, 14 Nov 2024 05:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2024-25_OVC_Scholar-Athlete_Release.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Stephens to be inducted into TTU Sports Hall of Fame Friday, Nov. 1",
        "link": "https://www.ttusports.com/general/2024-25/releases/20241101fx7e1u",
        "description": "COOKEVILLE, Tenn. – One of the most consistent and feared sluggers in the Ohio Valley Conference, Zach Stephens etched his name as one of the best players to don the purple and gold during his four-year career from 2011-14.",
        "pubDate": "Fri, 01 Nov 2024 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2024_HOF_Zach_Stephens_banner.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Penix Sr. to be inducted into TTU Sports Hall of Fame Friday, Nov. 1",
        "link": "https://www.ttusports.com/general/2024-25/releases/20241031gzhvz0",
        "description": "COOKEVILLE, Tenn. – A three-time All-Ohio Valley Conference selection during his career from 1992-95, Michael Penix Sr. still stands as one of the top rushers in Tennessee Tech history.",
        "pubDate": "Thu, 31 Oct 2024 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2024_HOF_Michael_Penix_Sr_banner.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Miles to be inducted into TTU Sports Hall of Fame Friday, Nov. 1",
        "link": "https://www.ttusports.com/general/2024-25/releases/20241030hhl5z6",
        "description": "COOKEVILLE, Tenn. – Few student-athletes provided a larger two-year impact for Tennessee Tech athletics than Daniel Miles did from 2013-14, establishing himself as one of the best baseball players in program history.",
        "pubDate": "Wed, 30 Oct 2024 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2024_HOF_Daniel_Miles_banner.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Freund Bobo to be inducted into TTU Sports Hall of Fame Friday, Nov. 1",
        "link": "https://www.ttusports.com/general/2024-25/releases/20241029ht0boo",
        "description": "COOKEVILLE, Tenn. – In the inaugural season of the Ohio Valley Conference soccer competition, Angela Freund Bobo took the conference by storm. ",
        "pubDate": "Tue, 29 Oct 2024 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2024_HOF_Angela_Freund_Bobo_banner.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Surplus sale to be held Saturday morning before Homecoming game",
        "link": "https://www.ttusports.com/general/2024-25/releases/20241028lco4je",
        "description": "COOKEVILLE, Tenn. – Tennessee Tech Athletics will hold a surplus sale on Saturday, Nov. 2, before the Golden Eagle football team’s Homecoming game against Lindenwood.\r\n\r\nIncluded in the sale will be team apparel and jerseys, including from football and basketball, from across the department’s athletic programs. No item will be priced above $25.\r\n\r\nThe sale will be in the big tent next to McGee Boulevard and will run from 9:30 a.m. until 12:30 p.m. Cash or credit cards will be accepted.",
        "pubDate": "Mon, 28 Oct 2024 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/sports/fball/2024-25/photos/2024_Tennessee_Tech_Golden_Eagle_Football_Fan_Information.jpg?max_width=600&max_height=315"
    },
    {
        "title": "Dillard to be inducted into TTU Sports Hall of Fame Friday, Nov. 1",
        "link": "https://www.ttusports.com/general/2024-25/releases/20241028tcco0u",
        "description": "COOKEVILLE, Tenn. – Across four seasons from 2009-2013, Judson Dillard established himself as arguably the best rebounding guard in Tennessee Tech history and one of the best scorers to ever suit up for the Golden Eagles.",
        "pubDate": "Mon, 28 Oct 2024 04:00:00 GMT",
        "image_url": "https://www.ttusports.com/general/2024-25/photos/2024_HOF_Judson_Dillard_banner.jpg?max_width=600&max_height=315"
    }
]